In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [2]:
df=pd.read_csv('GlobalLandTemperaturesByMajorCity.csv')

In [3]:
df.head()

,dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude
0,1849-01-01,26.704,1.435,Abidjan,Côte D'Ivoire,5.63N,3.23W
1,1849-02-01,27.434,1.362,Abidjan,Côte D'Ivoire,5.63N,3.23W
2,1849-03-01,28.101,1.612,Abidjan,Côte D'Ivoire,5.63N,3.23W
3,1849-04-01,26.140,1.387,Abidjan,Côte D'Ivoire,5.63N,3.23W
4,1849-05-01,25.427,1.200,Abidjan,Côte D'Ivoire,5.63N,3.23W

In [4]:
df.shape

(239177, 7)

In [5]:
# Changing the columns of the dataset to be more readable.
df.rename(columns={'AverageTemperature':'Temperature','AverageTemperatureUncertainty':'deviation'},inplace=True)

In [6]:
df.isnull().sum()

dt                 0
Temperature    11002
deviation      11002
City               0
Country            0
Latitude           0
Longitude          0
dtype: int64

In [29]:
#Find out the maximum temperature of Country
df.groupby('Country')['Temperature'].agg('max').sort_values(ascending=False).head()

Country
Iraq            38.283
Saudi Arabia    37.859
India           36.477
Pakistan        36.346
Sudan           35.700
Name: Temperature, dtype: float64

In [40]:
# Find out the minimum temperature of the city
df.groupby('City')['Temperature'].agg('min').sort_values(ascending=True).head(10)

City
Harbin             -26.772
Changchun          -23.272
Moscow             -19.376
Saint Petersburg   -18.644
Montreal           -18.363
Shenyang           -17.035
Kiev               -16.191
Toronto            -15.502
Taiyuan            -13.116
Berlin             -10.125
Name: Temperature, dtype: float64

In [45]:
# Find out the deviation with respect to country(uncertainty in climate)
df.groupby('Country')['deviation'].agg('max').sort_values(ascending=False).head(10)

Country
Germany           14.037
United Kingdom    13.560
France            13.224
Italy             12.166
Russia            11.685
United States     10.193
Spain              9.770
Ukraine            9.514
Canada             9.304
Turkey             8.459
Name: deviation, dtype: float64

In [49]:
#Find out the minimum deviation with respect to city(uncertainty in climate)
df.groupby('City')['deviation'].agg('min').sort_values(ascending=True)

City
Belo Horizonte    0.040
Tokyo             0.049
Calcutta          0.056
Changchun         0.056
Moscow            0.060
                  ...
Fortaleza         0.150
Mogadishu         0.172
Lima              0.173
Cape Town         0.177
Rio De Janeiro    0.257
Name: deviation, Length: 100, dtype: float64

In [65]:
df[df.City=='Bangalore']

,dt,Temperature,deviation,City,Country,Latitude,Longitude
17335,1796-01-01,22.672,2.317,Bangalore,India,12.05N,77.26E
17336,1796-02-01,24.420,1.419,Bangalore,India,12.05N,77.26E
17337,1796-03-01,26.092,2.459,Bangalore,India,12.05N,77.26E
17338,1796-04-01,27.687,1.746,Bangalore,India,12.05N,77.26E
17339,1796-05-01,27.619,1.277,Bangalore,India,12.05N,77.26E
...,...,...,...,...,...,...,...
19943,2013-05-01,29.189,0.514,Bangalore,India,12.05N,77.26E
19944,2013-06-01,25.835,0.384,Bangalore,India,12.05N,77.26E
19945,2013-07-01,25.008,0.416,Bangalore,India,12.05N,77.26E
19946,2013-08-01,25.236,0.520,Bangalore,India,12.05N,77.26E
19947,2013-09-01,NaN,NaN,Bangalore,India,12.05N,77.26E

In [80]:
df['dt'].dtypes

dtype('<M8[ns]')

In [79]:
df['dt']=pd.to_datetime(df['dt'])

In [82]:
# extract year from dt columns
df['year']=df['dt'].dt.year

In [83]:
# extract month from dt columns
df['month']=df['dt'].dt.month

In [84]:
df['year'].dtypes

dtype('int64')

In [85]:
df['month'].dtypes

dtype('int64')

In [91]:
# Using City Temperature for the month of June
df[(df['City']=='Pune') & (df['month']==6)]

,dt,Temperature,deviation,City,Country,Latitude,Longitude,year,month
178570,1796-06-01,27.443,3.295,Pune,India,18.48N,74.37E,1796,6
178582,1797-06-01,28.374,2.120,Pune,India,18.48N,74.37E,1797,6
178594,1798-06-01,27.911,2.171,Pune,India,18.48N,74.37E,1798,6
178606,1799-06-01,28.231,2.497,Pune,India,18.48N,74.37E,1799,6
178618,1800-06-01,27.647,1.430,Pune,India,18.48N,74.37E,1800,6
...,...,...,...,...,...,...,...,...,...
181126,2009-06-01,28.616,0.295,Pune,India,18.48N,74.37E,2009,6
181138,2010-06-01,27.834,0.200,Pune,India,18.48N,74.37E,2010,6
181150,2011-06-01,27.096,0.595,Pune,India,18.48N,74.37E,2011,6
181162,2012-06-01,28.131,0.303,Pune,India,18.48N,74.37E,2012,6
181174,2013-06-01,26.362,0.255,Pune,India,18.48N,74.37E,2013,6

In [95]:
# Using City Temperature for the month Of January
df[(df['City']=='Bombay') & (df['month']==1) & (df['year']>2010)]

,dt,Temperature,deviation,City,Country,Latitude,Longitude,year,month
32596,2011-01-01,24.543,0.441,Bombay,India,18.48N,72.68E,2011,1
32608,2012-01-01,23.844,0.439,Bombay,India,18.48N,72.68E,2012,1
32620,2013-01-01,24.187,0.858,Bombay,India,18.48N,72.68E,2013,1